
<!-- header -->
```fish
plan -chdir=terraform/org -lock=false
```
<!-- fmt -->

<!-- outline -->
<details><summary>Outline of changes.</summary>

```diff
# data.aws_iam_policy_document.cloudwatch will be read during apply
# (config refers to values not yet known)
+ aws_cloudtrail.this will be created
+ module.iam_assumable_role.aws_iam_role.this[0] will be created
+ module.iam_assumable_role.aws_iam_role_policy_attachment.custom[0] will be created
+ module.iam_policy.aws_iam_policy.policy[0] will be created
+ module.log_group.aws_cloudwatch_log_group.this[0] will be created
+ module.s3_bucket.aws_s3_bucket.this[0] will be created
+ module.s3_bucket.aws_s3_bucket_policy.this[0] will be created
+ module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
```
</details>
<!-- main -->
<details><summary>Plan: 8 to add, 0 to change, 0 to destroy.</br>

###### OpenTofu Preview by @chris3ware via [pull_request](https://github.com/3ware/aws-network-speciality/actions/runs/10769744790/job/29861623529) at 2024-09-09T08:45:52Z.
</summary>

```hcl

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu will perform the following actions:

  # data.aws_iam_policy_document.cloudwatch will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cloudwatch" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + resources = (sensitive value)
          + sid       = "AWSCloudTrailCreateLogStream"
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + resources = (sensitive value)
          + sid       = "AWSCloudTrailPutLogEvents"
        }
    }

  # aws_cloudtrail.this will be created
  + resource "aws_cloudtrail" "this" {
      + arn                           = (known after apply)
      + cloud_watch_logs_group_arn    = (known after apply)
      + cloud_watch_logs_role_arn     = (known after apply)
      + enable_log_file_validation    = true
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = true
      + is_multi_region_trail         = true
      + is_organization_trail         = true
      + name                          = "3ware-ans-demo-cloudtrail"
      + s3_bucket_name                = (known after apply)
      + tags_all                      = {
          + "3ware:environment-type" = "dev"
          + "3ware:project-id"       = "aws-network-speciality"
          + "3ware:service"          = "org"
          + "3ware:tofu"             = "true"
        }
    }

  # module.iam_assumable_role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = []
                          + Service = "cloudtrail.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "3ware-ans-demo-cloudtrail-cloudwatch-logs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "3ware:environment-type" = "dev"
          + "3ware:project-id"       = "aws-network-speciality"
          + "3ware:service"          = "org"
          + "3ware:tofu"             = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.iam_assumable_role.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "3ware-ans-demo-cloudtrail-cloudwatch-logs"
    }

  # module.iam_policy.aws_iam_policy.policy[0] will be created
  + resource "aws_iam_policy" "policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to permit cloudtrail to write to cloudwatch logs"
      + id               = (known after apply)
      + name             = "3ware-ans-demo-cloudtrail"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "3ware:environment-type" = "dev"
          + "3ware:project-id"       = "aws-network-speciality"
          + "3ware:service"          = "org"
          + "3ware:tofu"             = "true"
        }
    }

  # module.log_group.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "3ware-ans-demo-cloudtrail"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = {
          + "3ware:environment-type" = "dev"
          + "3ware:project-id"       = "aws-network-speciality"
          + "3ware:service"          = "org"
          + "3ware:tofu"             = "true"
        }
    }

  # module.s3_bucket.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "3ware-ans-demo-cloudtrail"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "3ware:environment-type" = "dev"
          + "3ware:project-id"       = "aws-network-speciality"
          + "3ware:service"          = "org"
          + "3ware:tofu"             = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_policy.this[0] will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetBucketAcl"
                      + Condition = {
                          + StringEquals = {
                              + "aws:SourceArn" = "arn:aws:cloudtrail:us-east-1:850410139067:trail/3ware-ans-demo-cloudtrail"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::3ware-ans-demo-cloudtrail"
                      + Sid       = "AWSCloudTrailAclCheck"
                    },
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + StringEquals = {
                              + "aws:SourceArn" = "arn:aws:cloudtrail:us-east-1:850410139067:trail/3ware-ans-demo-cloudtrail"
                              + "s3:x-amz-acl"  = "bucket-owner-full-control"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::3ware-ans-demo-cloudtrail/AWSLogs/850410139067/*"
                      + Sid       = "AWSCloudTrailWrite"
                    },
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + StringEquals = {
                              + "aws:SourceArn" = "arn:aws:cloudtrail:us-east-1:850410139067:trail/3ware-ans-demo-cloudtrail"
                              + "s3:x-amz-acl"  = "bucket-owner-full-control"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::3ware-ans-demo-cloudtrail/AWSLogs/o-l6llevpeqh/*"
                      + Sid       = "AWSCloudTrailWriteOrg"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 8 to add, 0 to change, 0 to destroy.

```
</details>
<!-- footer -->
<!-- tofu.29.-chdir-terraform-org.-out-tfplan -->